[
  {
    "name": "Barbarian",
    "hitDie": 12,
    "proficiencySkillSave": "STR, CON, Choose two from (Animal Handling, Athletics, Intimidation, Nature, Perception, and Survival)",
    "proficiencyArmsArmor": "Light armor, medium armor, shields, Simple weapons, martial weapons",
    "lvl1": "Rage:  You can enter a rage as a bonus action and gain the following benefits if you aren’t wearing heavy armor: \n• You have advantage on Strength checks and saving throws. \n• On strength melee weapon attacks, +2 damage at lvl1, +3 damage at lvl9 , +4 damage at lvl16\n• Resistance to bludgeoning, piercing, and slashing damage. \nCan’t cast spells while raging. Lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action. Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again. \nUnarmored Defense:  While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit\n",
    "lvl2": "Reckless Attack: On the first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn. \nDanger Sense:  You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated. \n",
    "lvl4": "Ability Score Improvement",
    "lvl5": "Extra Attack: You can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "lvl7": "Feral Instinct:  You have advantage on initiative rolls. If you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn.",
    "lvl8": "Ability Score Improvement II",
    "lvl9": "Brutal Critical: You can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack",
    "lvl11": "Relentless Rage: If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10.",
    "lvl12": "Ability Score Improvement III",
    "lvl13": "Brutal Critical II: You can roll two additional weapon damage die when determining the extra damage for a critical hit with a melee attack",
    "lvl15": "Persistent Rage: Your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it.",
    "lvl16": "Ability Score Improvement IV",
    "lvl17": "Brutal Critical III: You can roll three additional weapon damage die when determining the extra damage for a critical hit with a melee attack",
    "lvl18": "Indomitable Might: If your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
    "lvl19": "Ability Score Imporvment V",
    "lvl20": "Primal Champion: Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24.",
    "subClass": [
      {
        "name": "Path of the Berserker",
        "lvl3": "Frenzy: You can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion",
        "lvl6": "Mindless Rage: Beginning at 6th level, you can’t be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage.",
        "lvl10": "Intimidating Presence: You can use your action to frighten one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you. If the creature succeeds on its saving throw, you can’t use this feature on that creature again for 24 hours. ",
        "lvl14": "Retaliation: When you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature"
      }
    ]
  },
  {
    "name": "Bard",
    "hitDie": 8,
    "proficiencySkillSave": "DEX, CHA, Choose any three skills",
    "proficiencyArmsArmor": "Light armor, Simple weapons, hand crossbows, longswords, rapiers, shortswords",
    "proficiencyTools": "Three musical instruments of your choice",
    "lvl1": "Spellcasting: You regain all expended spell slots when you finish a long rest. You can cast any bard spell you know as a ritual if that spell has the ritual tag. You can use a musical instrument as a spellcasting focus for your bard spells.\n--Spell save DC = 8 + your proficiency bonus + your Charisma modifier\n --Spell attack modifier = your proficiency bonus + your Charisma modifier\nBardic Inspiration: Use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6. Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the GM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.\n",
    "lvl2": "Jack of All Trades: Add half your proficiency bonus, rounded down, to any ability check you make that doesn’t already include your proficiency bonus. \nSong of Rest: If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points.\n",
    "lvl4": "Ability Score Improvement",
    "lvl5": "Bardic Inspiration die becomes a d8\nFont of Inspiration: Regain all of your expended uses of Bardic Inspiration when you finish a short or long rest.",
    "lvl6": "Countercharm: As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. ",
    "lvl8": "Ability Score Improvement II",
    "lvl9": "Song of rest die becomes a d8",
    "lvl10": "Bardic Inspiration die becomes a d10\nExpertise II:  Choose another two skill proficiencies to gain this benefit. \nMagical Secrets: Choose two spells from any class. The chosen spells count as bard spells for you and are included in your number of known spells.\n",
    "lvl12": "Ability Score Improvement III",
    "lvl13": "Song of rest die becomes a d10",
    "lvl14": "Magical Secrets II: You learn two additional spells from any class",
    "lvl15": "Bardic Inspiration die becomes a d12 ",
    "lvl16": "Ability Score Improvement IV",
    "lvl17": "Song of rest die becomes a d12",
    "lvl18": "Magical Secrets III: You learn two additional spells from any class",
    "lvl19": "Ability Score Imporvment V",
    "lvl20": "Superior Inspiration: When you roll initiative and have no uses of Bardic Inspiration left, you regain one use.",
    "subClass": [
      {
        "name": "College of Lore",
        "lvl3": "Bonus Proficiencies: Gain proficiency with three skills of your choice. \nCutting Words: When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature’s roll. You can choose to use this feature after the creature makes its roll, but before the GM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can’t hear you or if it’s immune to being charmed.",
        "lvl6": "Additional Magical Secrets: Learn two more spells of your choice from any class. ",
        "lvl14": "Peerless Skill: When you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the GM tells you whether you succeed or fail."
      }
    ],
    "cantripsKnown": [
      2,
      2,
      2,
      3,
      3,
      3,
      3,
      3,
      3,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4
    ],
    "spellsKnown": [
      4,
      5,
      6,
      7,
      8,
      9,
      10,
      11,
      12,
      14,
      15,
      15,
      16,
      18,
      19,
      19,
      20,
      22,
      22,
      22
    ],
    "spellSlots": [
      [
        2,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      [
        0,
        0,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        2,
        2,
        2,
        2,
        2,
        2,
        2,
        2,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        2,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1
      ]
    ]
  },
  {
    "name": "Cleric",
    "hitDie": 8,
    "proficiencySkillSave": "WIS, CHA, Choose two from (History, Insight, Medicine, Persuasion, and Religion)",
    "proficiencyArmsArmor": "Light armor, medium armor, shields, Simple weapons",
    "lvl1": "Spellcasting: You regain all expended spell slots when you finish a long rest. You prepare a list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). You can change your list of prepared spells when you finish a long rest. \n--Spell save DC = 8 + your proficiency bonus + your Wisdom modifier\n--Spell attack modifier = your proficiency bonus + your Wisdom modifier\nYou can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared. You can use a holy symbol as a spellcasting focus for your cleric spells\nDomain Spells: Once you gain a domain spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day.\n",
    "lvl2": "Channel Divinity: You start with two effects: Turn Undead and an effect determined by your domain. When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again. Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\nTurn Undead: As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage. A turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there’s nowhere to move, the creature can use the Dodge action.\n",
    "lvl4": "Ability Score Improvement",
    "lvl5": "Destroy Undead: When an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below CR 1/2",
    "lvl6": "Channel Divinity II: You can use your Channel Divinity twice between rests.",
    "lvl8": "Ability Score Improvement II\nDestroy Undead II: Threshold CR increased to 1.",
    "lvl10": "Divine Intervention: Imploring your deity’s aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The GM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can’t use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.",
    "lvl11": "Destroy Undead III: Threshold CR increased to 2.",
    "lvl12": "Ability Score Improvement III",
    "lvl14": "Destroy Undead IV: Threshold CR increased to 3.",
    "lvl16": "Ability Score Improvement IV",
    "lvl17": "Destroy Undead V: Threshold CR increased to 4.",
    "lvl18": "Channel Divinity III: You can use your Channel Divinity three times between rests.",
    "lvl19": "Ability Score Imporvment V",
    "lvl20": "Divine Intervention II: Your call for intervention succeeds automatically, no roll required.",
    "subClass": [
      {
        "name": "Life Domain",
        "lvl1": "Domain Spells: Bless, Cure Wounds\nBonus Proficiency: Heavy Armor\nDisciple of Life: Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell’s level.",
        "lvl2": "Channel Divinity- Preserve Life: As an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can’t use this feature on an undead or a construct.",
        "lvl3": "Domain Spells: Lesser Restoration, Spiritual Weapon",
        "lvl5": "Domain Spells: Beacon of Hope, Revivify",
        "lvl6": "Blessed Healer: When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell’s level.",
        "lvl7": "Domain Spells: Death Ward, Guardian of Faith",
        "lvl8": "Divine Strike: Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. ",
        "lvl9": "Domain Spells: Mass Cure Wounds, Raise Dead",
        "lvl14": "Divine Strike II: Damage increases to 2d8.",
        "lvl17": "Supreme Healing: When you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die."
      }
    ],
    "cantripsKnown": [
      3,
      3,
      3,
      4,
      4,
      4,
      4,
      4,
      4,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5
    ],
    "spellSlots": [
      [
        2,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      [
        0,
        0,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        2,
        2,
        2,
        2,
        2,
        2,
        2,
        2,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        2,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1
      ]
    ]
  },
  {
    "name": "Druid",
    "hitDie": 8,
    "proficiencySkillSave": "INT, WIS, Choose two from (Arcana, Animal Handling, Insight, Medicine, Nature, Perception, Religion, and Survival)",
    "proficiencyArmsArmor": "Light armor, medium armor, shields (druids will not wear armor or use shields made of metal), Clubs, daggers, darts, javelins, maces, quarterstaffs, scimitars, sickles, slings, spears",
    "proficiencyTools": "Herbalism kit",
    "languages": "Druidic",
    "lvl1": "Spellcasting: You regain all expended spell slots when you finish a long rest. You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). You can also change your list of prepared spells when you finish a long rest.\n--Spell save DC = 8 + your proficiency bonus + your Wisdom modifier\n--Spell attack modifier = your proficiency bonus + your Wisdom modifier\nYou can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared. You can use a druidic focus as a spellcasting focus for your druid spells.\n",
    "lvl2": "Wild Shape: You can use your action to magically assume the shape of a beast with a max CR of 1/4 that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest. You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die. \n--Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature’s bonus instead of yours.\n--When you transform, you assume the beast’s hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. As long as the excess damage doesn’t reduce your normal form to 0 hit points, you aren’t knocked unconscious.\n--You can’t cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn’t break your concentration on a spell you’ve already cast, however, or prevent you from taking actions that are part of a spell that you’ve already cast.\n--You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can’t use any of your special senses, such as darkvision, unless your new form also has that sense.\n--You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the GM decides whether it is practical for the new form to wear a piece of equipment, based on the creature’s shape and size. Your equipment doesn’t change size or shape to match the new form, and any equipment that the new form can’t wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.\n",
    "lvl4": "Ability Score Improvement\nWild Shape II: CR max rasied to ½, swim speed allowed.",
    "lvl8": "Ability Score Improvement II\nWild Shape III: CR max raised to 1, flying speed allowed.",
    "lvl12": "Ability Score Improvement III",
    "lvl16": "Ability Score Improvement IV",
    "lvl18": "Timeless Body: For every 10 years that pass, your body ages only 1 year.\nBeast Spells: You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren’t able to provide material components",
    "lvl19": "Ability Score Imporvment V",
    "lvl20": "Archdruid: You can use your Wild Shape an unlimited number of times. Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren’t consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape.",
    "subClass": [
      {
        "name": "Circle of the Land",
        "lvl2": "Bonus Cantrip: You learn one additional druid cantrip of your choice.\nNatural Recovery: During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can’t use this feature again until you finish a long rest.",
        "lvl3": "Circle Spells: You gain access to circle spells connected to the land where you became a druid. Choose that land—arctic, coast, desert, forest, grassland, mountain, or swamp—and consult the associated list of spells. Once you gain access to a circle spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day.",
        "lvl5": "Circle Spells II",
        "lvl6": "Land’s Stride: Moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell.",
        "lvl7": "Circle Spells III",
        "lvl9": "Circle Spells IV",
        "lvl10": "Nature’s Ward: You can’t be charmed or frightened by elementals or fey, and you are immune to poison and disease.",
        "lvl14": "Nature’s Sanctuary: When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours. The creature is aware of this effect before it makes its attack against you."
      }
    ],
    "cantripsKnown": [
      2,
      2,
      2,
      3,
      3,
      3,
      3,
      3,
      3,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4
    ],
    "spellSlots": [
      [
        2,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      [
        0,
        0,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        2,
        2,
        2,
        2,
        2,
        2,
        2,
        2,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        2,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1
      ]
    ]
  },
  {
    "name": "Fighter",
    "hitDie": 10,
    "proficiencySkillSave": "STR, CON, Choose two skills from (Acrobatics, Animal Handling, Athletics, History, Insight, Intimidation, Perception, and Survival)",
    "proficiencyArmsArmor": "All armor, shields, Simple weapons, martial weapons",
    "lvl1": "Fighting Style: Choose one of the following options. You can’t take a Fighting Style option more than once.\n-- Archery: You gain a +2 bonus to attack rolls you make with ranged weapons.\n-- Defense: While you are wearing armor, you gain a +1 bonus to AC.\n-- Dueling: When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\n-- Great Weapon Fighting: When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.\n-- Protection: When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield. \n-- Two-Weapon Fighting: When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.\nSecond Wind: On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again.\n",
    "lvl2": "Action Surge: On your turn, you can take one additional action on top of your regular action and a possible bonus action. Once you use this feature, you must finish a short or long rest before you can use it again.",
    "lvl4": "Ability Score Improvement",
    "lvl5": "Extra Attack: You can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "lvl6": "Ability Score Improvement II",
    "lvl8": "Ability Score Improvement III",
    "lvl9": "Indomitable: You can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest.",
    "lvl11": "Extra Attack II: You can attack three times, instead of once, whenever you take the Attack action on your turn.",
    "lvl12": "Ability Score Improvement IV",
    "lvl13": "Indomitable II: You can use Indomitable twice between rests.",
    "lvl14": "Ability Score Imporvment V",
    "lvl16": "Ability Score Imporvment VI",
    "lvl17": "Action Surge II: You can use Action Surge twice before a rest, but only once on the same turn.\nIndomitable III: You can use Indomitable three times between rests.",
    "lvl19": "Ability Score Imporvment VII",
    "lvl20": "Extra Attack III: You can attack four times, instead of once, whenever you take the Attack action on your turn.",
    "subClass": [
      {
        "name": "Champion",
        "lvl3": "Improved Critical: Your weapon attacks score a critical hit on a roll of 19 or 20.",
        "lvl7": "Remarkable Athlete: You can add half your proficiency bonus (round up) to any Strength, Dexterity, or Constitution check you make that doesn’t already use your proficiency bonus. In addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier.",
        "lvl10": "Additional Fighting Style: You can choose a second option from the Fighting Style class feature.",
        "lvl15": "Superior Critical: Your weapon attacks score a critical hit on a roll of 18–20.",
        "lvl18": "Survivor: You At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. You don’t gain this benefit if you have 0 hit points."
      }
    ]
  },
  {
    "name": "Monk",
    "hitDie": 8,
    "proficiencySkillSave": "STR, DEX, Choose two from (Acrobatics, Athletics, History, Insight, Religion, and Stealth)",
    "proficiencyArmsArmor": "Simple weapons, shortswords",
    "proficiencyTools": "Choose one type of artisan’s tools or one musical instrument",
    "lvl1": "Unarmored DefenseWhile you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier.\nMartial Arts: You gain the following benefits while you are unarmed or wielding only monk weapons and you aren’t wearing armor or wielding a shield: \n--You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.\n--You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. \n-- When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action.\n",
    "lvl2": "Ki: You have a number of Ki points equal to your monk level. You can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points. Some of your ki features require your target to make a saving throw to resist the feature’s effects. The saving throw DC is calculated as follows:\n Ki save DC = 8 + your proficiency bonus + your Wisdom modifier \n--Flurry of Blows: Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action. \n--Patient Defense: You can spend 1 ki point to take the Dodge action as a bonus action on your turn. \n--Step of the Wind: You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn.\nUnarmored Movement: Your speed increases by 10 feet while you are not wearing armor or wielding a shield. \n",
    "lvl3": "Deflect Missiles: You can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level. If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack, which has a normal range of 20 feet and a long range of 60 feet.",
    "lvl4": "Ability Score Improvement\nSlow Fall: You can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level.",
    "lvl5": "Extra Attack: You can attack twice, instead of once, whenever you take the Attack action on your turn.\nStunning Strike: When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn.\nMartial Arts II: Die increased to d6.\n",
    "lvl6": "Ki-Empowered Strikes: Your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\nUnarmored Movement II: Speed bonus increased to 15 feet.",
    "lvl7": "Evasion: When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail. \nStillness of Mind: You can use your action to end one effect on yourself that is causing you to be charmed or frightened.\n",
    "lvl8": "Ability Score Improvement II",
    "lvl9": "Unarmored Movement II: You gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move.",
    "lvl10": "Purity of Body: You are immune to disease and poison.\nUnarmored Movement III: Speed bonus increased to 20 feet.",
    "lvl11": "Martial Arts III: Die increased to d8.",
    "lvl12": "Ability Score Improvement III",
    "lvl13": "Tongue of the Sun and Moon: You understand all spoken languages. Moreover, any creature that can understand a language can understand what you say.",
    "lvl14": "Diamond Soul: Your mastery of ki grants you proficiency in all saving throws. Additionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result.\nUnarmored Movement IV: Speed bonus increased to 25 feet.\n",
    "lvl15": "Timeless Body: You suffer none of the frailty of old age, and you can’t be aged magically. You can still die of old age, however. In addition, you no longer need food or water.",
    "lvl16": "Ability Score Improvement IV",
    "lvl17": "Martial Arts IV: Die increased to d10.",
    "lvl18": "Empty Body: You can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage. Additionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can’t take any other creatures with you.\nUnarmored Movement V: Speed bonus increased to 30 feet.\n",
    "lvl19": "Ability Score Imporvment V",
    "lvl20": "Perfect Self: When you roll for initiative and have no ki points remaining, you regain 4 ki points.",
    "subClass": [
      {
        "name": "Way of the Open Hand",
        "lvl3": "Open Hand Technique: Whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects on that target: \n-- It must succeed on a Dexterity saving throw or be knocked prone. \n-- It must make a Strength saving throw. If it fails, you can push it up to 15 feet away from you. \n-- It can’t take reactions until the end of your next turn. ",
        "lvl6": "Wholeness of Body: As an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again. ",
        "lvl11": "Tranquility: At the end of a long rest, you gain the effect of a sanctuary spell that lasts until the start of your next long rest (the spell can end early as normal). The saving throw DC for the spell equals 8 + your Wisdom modifier + your proficiency bonus.",
        "lvl17": "Quivering Palm: When you hit a creature with an unarmed strike, you can spend 3 ki points to start these imperceptible vibrations, which last for a number of days equal to your monk level. The vibrations are harmless unless you use your action to end them. To do so, you and the target must be on the same plane of existence. When you use this action, the creature must make a Constitution saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes 10d10 necrotic damage. You can have only one creature under the effect of this feature at a time. You can choose to end the vibrations harmlessly without using an action."
      }
    ]
  },
  {
    "name": "Paladin",
    "hitDie": 10,
    "proficiencySkillSave": "WIS, CHA, Choose two from (Athletics, Insight, Intimidation, Medicine, Persuasion, and Religion)",
    "proficiencyArmsArmor": "All armor, shields, Simple weapons, martial weapons",
    "lvl1": "Divine Sense: As an action, until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity. Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell. You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses.\nLay on Hands: You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5. As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool. Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one. This feature has no effect on undead and constructs.\n",
    "lvl2": "Fighting Style: Choose one of the following options. You can’t take a Fighting Style option more than once.\n-- Archery: You gain a +2 bonus to attack rolls you make with ranged weapons.\n-- Defense: While you are wearing armor, you gain a +1 bonus to AC.\n-- Dueling: When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\n-- Great Weapon Fighting: When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.\n-- Protection: When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield. \n-- Two-Weapon Fighting: When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.\nSpellcasting: You regain all expended spell slots when you finish a long rest. You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). You can change your list of prepared spells when you finish a long rest.\n-- Spell save DC = 8 + your proficiency bonus + your Charisma modifier\n-- Spell attack modifier = your proficiency bonus + your Charisma modifier\nYou can use a holy symbol as a spellcasting focus for your paladin spells.\nDivine Smite: When you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon’s damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend.\n",
    "lvl3": "Divine Health: You are Immune to disease.\nOath Spells: Once you gain access to an oath spell, you always have it prepared. Oath spells don’t count against the number of spells you can prepare each day.\nChannel Divinity: When you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again. Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC.\n",
    "lvl4": "Ability Score Improvement",
    "lvl5": "Extra Attack: You can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "lvl6": "Aura of Protection: Whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus.",
    "lvl8": "Ability Score Improvement II",
    "lvl10": "Aura of Courage: You and friendly creatures within 10 feet of you can’t be frightened while you are conscious.",
    "lvl11": "Improved Divine Smite: Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage. If you also use your Divine Smite with an attack, you add this damage to the extra damage of your Divine Smite.",
    "lvl12": "Ability Score Improvement III",
    "lvl14": "Cleansing Touch: You can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest.",
    "lvl16": "Ability Score Improvement IV",
    "lvl18": "Aura of Protection II: Range increase to 30ft.\nAura of Courage II: Range increase to 30ft.",
    "lvl19": "Ability Score Imporvment V",
    "subClass": [
      {
        "name": "Oath of Devotion",
        "lvl1": "Tenets: Honesty, Courage, Compassion, Honor, Duty",
        "lvl3": "Oath Spells: Protection from Evil and Good, Sanctuary\nChannel Divinity: You gain the following two Channel Divinity options. \n--Sacred Weapon: As an action, for 1 minute, you add your Charisma modifier to attack rolls made with a weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration. \n--Turn the Unholy: As an action, each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage. A turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there’s nowhere to move, the creature can use the Dodge action.",
        "lvl5": "Oath Spells II: Lesser Restoration, Zone of Truth",
        "lvl7": "Aura of Devotion: You and friendly creatures within 10 feet of you can’t be charmed while you are conscious.",
        "lvl9": "Oath Spells III: Beacon of Hope, Dispel Magic",
        "lvl13": "Oath Spells IV: Freedom of Movement, Guardian of Faith",
        "lvl15": "Purity of Spirit: You are always under the effects of a protection from evil and good spell.",
        "lvl17": "Oath Spells V: Commune, Flame Strike",
        "lvl18": "Aura of Devotion II: Aura range increase to 30ft.",
        "lvl20": "Holy Nimbus: As an action, for 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that. Whenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage. In addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead. Once you use this feature, you can’t use it again until you finish a long rest."
      }
    ],
    "spellSlots": [
      [
        0,
        2,
        3,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      [
        0,
        0,
        0,
        0,
        2,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        2,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        2,
        2,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        2,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ]
    ]
  },
  {
    "name": "Ranger",
    "hitDie": 10,
    "proficiencySkillSave": "STR, DEX, Choose three from (Animal Handling, Athletics, Insight, Investigation, Nature, Perception, Stealth, and Survival)",
    "proficiencyArmsArmor": "Light armor, medium armor, shields, Simple weapons, martial weapons",
    "lvl1": "Favored Enemy: Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies. You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all.\nNatural Explorer: Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, or swamp. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in. While traveling for an hour or more in your favored terrain, you gain the following benefits: \n-- Difficult terrain doesn’t slow your group’s travel. \n-- Your group can’t become lost except by magical means. \n-- Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger. \n-- If you are traveling alone, you can move stealthily at a normal pace. \n-- When you forage, you find twice as much food as you normally would. \n-- While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area.\n",
    "lvl2": "Fighting Style: Choose one of the following options. You can’t take a Fighting Style option more than once.\n-- Archery: You gain a +2 bonus to attack rolls you make with ranged weapons.\n-- Defense: While you are wearing armor, you gain a +1 bonus to AC.\n-- Dueling: When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\n-- Great Weapon Fighting: When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.\n-- Protection: When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield. \n-- Two-Weapon Fighting: When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.\nSpellcasting: You regain all expended spell slots when you finish a long rest. When you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list.\n-- Spell save DC = 8 + your proficiency bonus + your Wisdom modifier\n-- Spell attack modifier = your proficiency bonus + your Wisdom modifier\n",
    "lvl3": "Primeval Awareness: You can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn’t reveal the creatures’ location or number.",
    "lvl4": "Ability Score Improvement",
    "lvl5": "Extra Attack: You can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "lvl6": "Favored Enemy II: Choose one additional favored enemy, as well as an associated language.\nNatural Explorer II: Choose and additional favored terrain type.\n",
    "lvl8": "Ability Score Improvement II\nLand’s Stride: Moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell.\n",
    "lvl10": "Natural Explorer II: Choose and additional favored terrain type.\nHide in Plain Sight: you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage. Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit.\n",
    "lvl12": "Ability Score Improvement III",
    "lvl14": "Favored Enemy III: Choose one additional favored enemy, as well as an associated language.\nVanish: You can use the Hide action as a bonus action on your turn. Also, you can’t be tracked by nonmagical means, unless you choose to leave a trail.\n",
    "lvl16": "Ability Score Improvement IV",
    "lvl18": "Feral Senses: When you attack a creature you can’t see, your inability to see it doesn’t impose disadvantage on your attack rolls against it. You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn’t hidden from you and you aren’t blinded or deafened",
    "lvl19": "Ability Score Imporvment V",
    "lvl20": "Foe Slayer: Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied.",
    "subClass": [
      {
        "name": "Hunter",
        "lvl3": "Hunters Prey:(Choose One)\n-- Colossus Slayer: When you hit a creature with a weapon attack, the creature takes an extra 1d8 damage if it’s below its hit point maximum. You can deal this extra damage only once per turn.\n-- Giant Killer: When a Large or larger creature within 5 feet of you hits or misses you with an attack, you can use your reaction to attack that creature immediately after its attack, provided that you can see the creature.\n-- Horde Breaker: Once on each of your turns when you make a weapon attack, you can make another attack with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon.\n",
        "lvl7": "Defensive Tactics: (Choose One)\n--Escape the Horde: Opportunity attacks against you are made with disadvantage.\n--Multiattack Defense: When a creature hits you with an attack, you gain a +4 bonus to AC against all subsequent attacks made by that creature for the rest of the turn.\n--Steel Will: You have advantage on saving throws against being frightened.\n",
        "lvl11": "Multiattack: (Choose One)\n--Volley: You can use your action to make a ranged attack against any number of creatures within 10 feet of a point you can see within your weapon’s range. You must have ammunition for each target, as normal, and you make a separate attack roll for each target\n--Whirlwind Attack: You can use your action to make a melee attack against any number of creatures within 5 feet of you, with a separate attack roll for each target.\n",
        "lvl15": "Superior Hunter’s Defense: (Choose One)\n--Evasion: When you are subjected to an effect, such as a red dragon’s fiery breath or a lightning bolt spell, that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.\n--Stand Against the Tide: When a hostile creature misses you with a melee attack, you can use your reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice.\n--Uncanny Dodge: When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack’s damage against you.\n"
      }
    ],
    "spellsKnown": [
      0,
      2,
      3,
      3,
      4,
      4,
      5,
      5,
      6,
      6,
      7,
      7,
      8,
      8,
      9,
      9,
      10,
      10,
      11,
      11
    ],
    "spellSlots": [
      [
        0,
        2,
        3,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      [
        0,
        0,
        0,
        0,
        2,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        2,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        2,
        2,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        2,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ]
    ]
  },
  {
    "name": "Rogue",
    "hitDie": 8,
    "proficiencySkillSave": "DEX, INT, Choose four from (Acrobatics, Athletics, Deception, Insight, Intimidation, Investigation, Perception, Performance, Persuasion, Sleight of Hand, and Stealth)",
    "proficiencyArmsArmor": "Light Armor, Simple weapons, hand crossbows, longswords, rapiers, shortswords",
    "proficiencyTools": "Theive's Tools",
    "languages": "Thieve's Cant",
    "lvl1": "Expertise: Choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves’ tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. \nSneak Attack: Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon. You don’t need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn’t incapacitated, and you don’t have disadvantage on the attack roll.\n",
    "lvl2": "Cunning Action: You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action.",
    "lvl3": "Sneak Attack II: Attack damage raised to 2d6.",
    "lvl4": "Ability Score Improvement",
    "lvl5": "Uncanny Dodge: When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack’s damage against you.\nSneak Attack III: Attack damage raised to 3d6.\n",
    "lvl6": "Expertise II: Choose two more of your proficiencies (in skills or with thieves’ tools)",
    "lvl7": "Evasion: When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.\nSneak Attack IV: Attack damage raised to 4d6.\n",
    "lvl8": "Ability Score Improvement II",
    "lvl9": "Sneak Attack V: Attack damage raised to 5d6.",
    "lvl11": "Reliable Talent: Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10.\nSneak Attack VI: Attack damage raised to 6d6.\n",
    "lvl12": "Ability Score Improvement III",
    "lvl13": "Sneak Attack VII: Attack damage raised to 7d6.",
    "lvl14": "Blindsense: If you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you.",
    "lvl15": "Slippery Mind: You gain proficiency in Wisdom saving throws.\nSneak Attack VIII: Attack damage raised to 8d6.\n",
    "lvl16": "Ability Score Improvement IV",
    "lvl17": "Sneak Attack IX: Attack damage raised to 9d6.",
    "lvl18": "Elusive: No attack roll has advantage against you while you aren’t incapacitated.",
    "lvl19": "Ability Score Imporvment V\nSneak Attack X: Attack damage raised to 10d6.\n",
    "lvl20": "Stroke of Luck: If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20. Once you use this feature, you can’t use it again until you finish a short or long rest.",
    "subClass": [
      {
        "name": "Thief",
        "lvl3": "Fast Hands: Starting You can use the bonus action granted by your Cunning Action to make a Dexterity (Sleight of Hand) check, use your thieves’ tools to disarm a trap or open a lock, or take the Use an Object action.\nSecond-Story Work: Climbing no longer costs you extra movement. In addition, when you make a running jump, the distance you cover increases by a number of feet equal to your Dexterity modifier.\n",
        "lvl9": "Supreme Sneak: You have advantage on a Dexterity (Stealth) check if you move no more than half your speed on the same turn.",
        "lvl13": "Use Magic Device: You ignore all class, race, and level requirements on the use of magic items.",
        "lvl17": "Thief’s Reflexes: You can take two turns during the first round of any combat. You take your first turn at your normal initiative and your second turn at your initiative minus 10. You can’t use this feature when you are surprised."
      }
    ]
  },
  {
    "name": "Sorcerer",
    "hitDie": 6,
    "proficiencySkillSave": "CON, CHA, Choose two from (Arcana, Deception, Insight, Intimidation, Persuasion, and Religion)",
    "proficiencyArmsArmor": "Daggers, darts, slings, quarterstaffs, light crossbows",
    "lvl1": "Spellcasting: You regain all expended spell slots when you finish a long rest. When you gain a level in this class, you can choose one of the sorcerer spells you know and replace it with another spell from the sorcerer spell list.\n-- Spell save DC = 8 + your proficiency bonus + your Charisma modifier\n-- Spell attack modifier = your proficiency bonus + your Charisma modifier\nYou can use an arcane focus as a spellcasting focus for your sorcerer spells.\n",
    "lvl2": "Font of Magic: --Sorcery Points: You have a number of sorcery points equal to you sorcery level. You regain all spent sorcery points when you finish a long rest.\n--Creating Spell Slots:  You can spend a number of sorcery points to gain a spell slot as a bonus action. Any spell slot you create with this feature vanishes when you finish a long rest. (2 for 1st lvl, 3 for 2nd lvl, 5 for 3rd lvl, 6 for 4th lvl, 7 for 5th lvl)\n--Creating Sorcery Points: As a bonus action on your turn, you can expend one spell slot and gain a number of sorcery points equal to the slot’s level.\n",
    "lvl3": "Metamagic: You gain two of the following Metamagic options of your choice. You can use only one Metamagic option on a spell when you cast it, unless otherwise noted. \n--Careful Spell: When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell’s full force. To do so, you spend 1 sorcery point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell. \n--Distant Spell: When you cast a spell that has a range of 5 feet or greater, you can spend 1 sorcery point to double the range of the spell. When you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the spell 30 feet. \n--Empowered: Spell When you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls. You can use Empowered Spell even if you have already used a different Metamagic option during the casting of the spell. \n--Extended Spell: When you cast a spell that has a duration of 1 minute or longer, you can spend 1 sorcery point to double its duration, to a maximum duration of 24 hours. \n--Heightened Spell: When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 sorcery points to give one target of the spell disadvantage on its first saving throw made against the spell. \n--Quickened Spell: When you cast a spell that has a casting time of 1 action, you can spend 2 sorcery points to change the casting time to 1 bonus action for this casting. \n--Subtle Spell: When you cast a spell, you can spend 1 sorcery point to cast it without any somatic or verbal components. \n--Twinned Spell: When you cast a spell that targets only one creature and doesn’t have a range of self, you can spend a number of sorcery points equal to the spell’s level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip). To be eligible, a spell must be incapable of targeting more than one creature at the spell’s current level. \n",
    "lvl4": "Ability Score Improvement",
    "lvl8": "Ability Score Improvement II",
    "lvl10": "Metamagic II: Gain another metamagic.",
    "lvl12": "Ability Score Improvement III",
    "lvl16": "Ability Score Improvement IV",
    "lvl17": "Metamagic III: Gain another metamagic",
    "lvl19": "Ability Score Imporvment V",
    "lvl20": "Sorcerous Restoration: You regain 4 expended sorcery points whenever you finish a short rest.",
    "subClass": [
      {
        "name": "Draconic Bloodline",
        "lvl1": "Dragon Ancestor: You choose one type of dragon as your ancestor. You can speak, read, and write Draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your proficiency bonus is doubled if it applies to the check.\nDraconic Resilience: Your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class. Additionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren’t wearing armor, your AC equals 13 + your Dexterity modifier.\n",
        "lvl6": "Elemental Affinity: when you cast a spell that deals damage of the type associated with your draconic ancestry, you can add your Charisma modifier to one damage roll of that spell. At the same time, you can spend 1 sorcery point to gain resistance to that damage type for 1 hour.",
        "lvl14": "Dragon Wings: You gain the ability to sprout a pair of dragon wings from your back, gaining a flying speed equal to your current speed. You can create these wings as a bonus action on your turn. They last until you dismiss them as a bonus action on your turn. You can’t manifest your wings while wearing armor unless the armor is made to accommodate them, and clothing not made to accommodate your wings might be destroyed when you manifest them.",
        "lvl18": "Draconic Presence: As an action, you can spend 5 sorcery points to draw on this power and exude an aura of awe or fear (your choice) to a distance of 60 feet. For 1 minute or until you lose your concentration (as if you were casting a concentration spell), each hostile creature that starts its turn in this aura must succeed on a Wisdom saving throw or be charmed (if you chose awe) or frightened (if you chose fear) until the aura ends. A creature that succeeds on this saving throw is immune to your aura for 24 hours."
      }
    ],
    "cantripsKnown": [
      4,
      4,
      4,
      5,
      5,
      5,
      5,
      5,
      5,
      6,
      6,
      6,
      6,
      6,
      6,
      6,
      6,
      6,
      6,
      6
    ],
    "spellsKnown": [
      2,
      3,
      4,
      5,
      6,
      7,
      8,
      9,
      10,
      11,
      12,
      12,
      13,
      13,
      14,
      14,
      15,
      15,
      15,
      15
    ],
    "spellSlots": [
      [
        2,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      [
        0,
        0,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        2,
        2,
        2,
        2,
        2,
        2,
        2,
        2,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        2,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1
      ]
    ]
  },
  {
    "name": "Warlock",
    "hitDie": 8,
    "proficiencySkillSave": "WIS, CHA, \\nChoose two skills from (Arcana, Deception, History, Intimidation, Investigation, Nature, and Religion)",
    "proficiencyArmsArmor": "Simple weapons, Light Armor",
    "lvl1": "Spellcasting: You regain all expended spell slots when you finish a short or long rest. When you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list.\n Spell save DC = 8 + your proficiency bonus + your Charisma modifier\n Spell attack modifier = your proficiency bonus + your Charisma modifier\nYou can use an arcane focus as a spellcasting focus for your warlock spells.\nExpanded Spell List: Additional spell options are available based on your patron.\n",
    "lvl2": "2 Eldritch Invocations, When you gain a level in this class, you can choose one of the invocations you know and replace it with another.",
    "lvl3": "(pick one)\nPact of the Chain: You learn the find familiar spell and can cast it as a ritual. Normal or special forms (imp, pseudodragon, quasit, or sprite). Additionally, when you take the Attack action, you can forgo one of your own attacks to allow your familiar to make one attack of its own with its reaction.\nPact of the Blade: You can use your action to create a magical pact weapon in your empty hand. You are proficient with it. \nPact of the Tome: Choose three cantrips from any class’s spell list. You can cast those cantrips at will. They don’t count against your number of cantrips known. \n",
    "lvl4": "Ability Score Improvement",
    "lvl5": "3 Eldritch Invocations Known",
    "lvl7": "4 Eldritch Invocations Known",
    "lvl8": "Ability Score Improvement II",
    "lvl9": "5 Eldritch Invocations Known",
    "lvl11": "Mystic Arcanum: Choose one 6thlevel spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.",
    "lvl12": "Ability Score Improvement III\\n6 Eldritch Invocations Known",
    "lvl13": "Mystic Arcanum: Choose one 7thlevel spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.",
    "lvl15": "Mystic Arcanum: Choose one 8thlevel spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.\\n7 Eldritch Invocations Known",
    "lvl16": "Ability Score Improvement IV",
    "lvl17": "Mystic Arcanum: Choose one 9thlevel spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.",
    "lvl18": "8 Eldritch Invocations Known",
    "lvl19": "Ability Score Imporvment V",
    "lvl20": "Eldritch Master: You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again.",
    "subClass": [
      {
        "name": "The Fiend",
        "lvl1": "Dark One’s Blessing: When you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1).",
        "lvl6": "Dark One’s Own Luck: When you make an ability check or a saving throw, you can use this feature to add a d10 to your roll. You can do so after seeing the initial roll but before any of the roll’s effects occur. Once you use this feature, you can’t use it again until you finish a short or long rest.",
        "lvl10": "Fiendish Resilience: You can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance.",
        "lvl14": "Hurl Through Hell: When you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape. At the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience. Once you use this feature, you can’t use it again until you finish a long rest."
      }
    ],
    "cantripsKnown": [
      2,
      2,
      2,
      3,
      3,
      3,
      3,
      3,
      3,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4
    ],
    "spellsKnown": [
      2,
      3,
      4,
      5,
      6,
      7,
      8,
      9,
      10,
      10,
      11,
      11,
      12,
      12,
      13,
      13,
      14,
      14,
      15,
      15
    ],
    "spellSlots": [
      [
        1,
        2,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        2,
        2,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        2,
        2,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        2,
        2,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        2,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        4,
        4,
        4,
        4
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ]
    ]
  },
  {
    "name": "Wizard",
    "hitDie": 6,
    "proficiencySkillSave": "INT, WIS\\nChoose two from (Arcana, History, Insight, Investigation, Medicine, and Religion)",
    "proficiencyArmsArmor": "Daggers, darts, slings, quarterstaffs, light crossbows",
    "lvl1": "Spellcasting: You prepare the list of wizard spells that are available for you to cast. To do so, choose a number of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell).\n Spell save DC = 8 + your proficiency bonus + your Intelligence modifier\n Spell attack modifier = your proficiency bonus + your Intelligence modifier\nYou can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don’t need to have the spell prepared. You can use an arcane focus as a spellcasting focus for your wizard spells.\n Each time you gain a wizard level, you can add two wizard spells of your choice to your spellbook for free. Each of these spells must be of a level for which you have spell slots.\nArcane Recovery: Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.\n",
    "lvl4": "Ability Score Improvement",
    "lvl8": "Ability Score Improvement II",
    "lvl12": "Ability Score Improvement III",
    "lvl16": "Ability Score Improvement IV",
    "lvl18": "Spell Mastery:  Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal. By spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels.",
    "lvl19": "Ability Score Imporvment V",
    "lvl20": "Signature Spells: Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don’t count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can’t do so again until you finish a short or long rest. If you want to cast either spell at a higher level, you must expend a spell slot as normal.",
    "subClass": [
      {
        "name": "School of Evocation",
        "lvl2": "Evocation Savant: The gold and time you must spend to copy an evocation spell into your spellbook is halved.\nSculpt Spells: When you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell’s level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save.\n",
        "lvl6": "Potent Cantrip: When a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip’s damage (if any) but suffers no additional effect from the cantrip.",
        "lvl10": "Empowered Evocation: You can add your Intelligence modifier to one damage roll of any wizard evocation spell you cast.",
        "lvl14": "Overchannel: When you cast a wizard spell of 1st through 5th level that deals damage, you can deal maximum damage with that spell. The first time you do so, you suffer no adverse effect. If you use this feature again before you finish a long rest, you take 2d12 necrotic damage for each level of the spell, immediately after you cast it. Each time you use this feature again before finishing a long rest, the necrotic damage per spell level increases by 1d12. This damage ignores resistance and immunity."
      }
    ],
    "cantripsKnown": [
      3,
      3,
      3,
      4,
      4,
      4,
      4,
      4,
      4,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5
    ],
    "spellSlots": [
      [
        2,
        3,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4,
        4
      ],
      [
        0,
        0,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        2,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        2,
        2,
        2,
        2,
        2,
        2,
        2,
        2,
        3,
        3,
        3
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        2,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        2
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1,
        1,
        1
      ],
      [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        1
      ]
    ]
  }
]